In [4]:
import numpy as np
import pandas as pd

In [5]:
df1 = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [33]:
df1

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [7]:
type(df1)

pandas.core.frame.DataFrame

In [34]:
df1['From_To']

0        LoNDon_paris
1        MAdrid_miLAN
2    londON_StockhOlm
3      Budapest_PaRis
4     Brussels_londOn
Name: From_To, dtype: object

In [35]:
df1

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [88]:
df1.dtypes

From_To          object
FlightNumber    float64
RecentDelays     object
Airline          object
dtype: object

In [71]:
s=df1["From_To"].astype(str)
s

0        LoNDon_paris
1        MAdrid_miLAN
2    londON_StockhOlm
3      Budapest_PaRis
4     Brussels_londOn
Name: From_To, dtype: object

In [76]:
type(s)

pandas.core.series.Series

In [41]:
res = df1['From_To'].str.split('_')

In [46]:
res

0        [LoNDon, paris]
1        [MAdrid, miLAN]
2    [londON, StockhOlm]
3      [Budapest, PaRis]
4     [Brussels, londOn]
Name: From_To, dtype: object

In [47]:
df1['From_To_Temp']=res

In [60]:
df1

,From_To,FlightNumber,RecentDelays,Airline,From_To_Temp
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),"[LoNDon, paris]"
1,MAdrid_miLAN,NaN,[],<Air France> (12),"[MAdrid, miLAN]"
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),"[londON, StockhOlm]"
3,Budapest_PaRis,NaN,[13],12. Air France,"[Budapest, PaRis]"
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""","[Brussels, londOn]"

In [ ]:
lsredays=df1['RecentDelays'].tolist()

In [58]:
del df1['column2']

In [59]:
df1

,From_To,FlightNumber,RecentDelays,Airline,From_To_Temp
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),"[LoNDon, paris]"
1,MAdrid_miLAN,NaN,[],<Air France> (12),"[MAdrid, miLAN]"
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),"[londON, StockhOlm]"
3,Budapest_PaRis,NaN,[13],12. Air France,"[Budapest, PaRis]"
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""","[Brussels, londOn]"

In [61]:
fromto=df1['From_To_Temp'].tolist()
fromto

[['LoNDon', 'paris'],
 ['MAdrid', 'miLAN'],
 ['londON', 'StockhOlm'],
 ['Budapest', 'PaRis'],
 ['Brussels', 'londOn']]

In [63]:
fromtores=list(map(list, zip(*fromto)))
fromtores

[['LoNDon', 'MAdrid', 'londON', 'Budapest', 'Brussels'],
 ['paris', 'miLAN', 'StockhOlm', 'PaRis', 'londOn']]

In [66]:
df1['From'] = fromtores[0]

In [67]:
df1['To'] = fromtores[1]

In [68]:
df1

,From_To,FlightNumber,RecentDelays,Airline,From_To_Temp,From,To
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),"[LoNDon, paris]",LoNDon,paris
1,MAdrid_miLAN,NaN,[],<Air France> (12),"[MAdrid, miLAN]",MAdrid,miLAN
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),"[londON, StockhOlm]",londON,StockhOlm
3,Budapest_PaRis,NaN,[13],12. Air France,"[Budapest, PaRis]",Budapest,PaRis
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""","[Brussels, londOn]",Brussels,londOn

In [69]:
df1.dtypes

From_To          object
FlightNumber    float64
RecentDelays     object
Airline          object
From_To_Temp     object
From             object
To               object
dtype: object

In [ ]:
del df1['From_To_Temp']

In [73]:
df1

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,NaN,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,NaN,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",Brussels,londOn

In [74]:
df1['From']= df1['From'].str.capitalize()

In [75]:
df1['To']= df1['To'].str.capitalize()

In [76]:
df1

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),London,Paris
1,MAdrid_miLAN,NaN,[],<Air France> (12),Madrid,Milan
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),London,Stockholm
3,Budapest_PaRis,NaN,[13],12. Air France,Budapest,Paris
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",Brussels,London

In [77]:
type(df1['FlightNumber'])

pandas.core.series.Series

In [78]:
df1['FlightNumber'] = df1['FlightNumber'].fillna(0)
df1['FlightNumber']

0    10045.0
1        0.0
2    10065.0
3        0.0
4    10085.0
Name: FlightNumber, dtype: float64

In [79]:
ls=df1['FlightNumber'].tolist()
ls

[10045.0, 0.0, 10065.0, 0.0, 10085.0]

In [80]:
ls=df1['FlightNumber'].tolist()
ls1 = [round(x) for x in ls]
ls1

[10045, 0, 10065, 0, 10085]

In [91]:
ls2=convertflightnumber(ls1)
#print(ls2)
#s=pd.Series(ls2)
#print(s)
df1['FlightNumber_new'] = pd.Series(ls2)
df1['FlightNumber_new']
#s = pd.Series(ls2)

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber_new, dtype: int64

In [90]:
def convertflightnumber(ls1):
    lsret=[]
    for i in range(0,len(ls1)):
        if(ls1[i]==0):
            a=int(ls1[i-1]+10)
            lsret.append(a)
        else:
            b=int(ls1[i])
            lsret.append(b)
    return lsret

In [89]:
df1

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),London,Paris
1,MAdrid_miLAN,0.0,[],<Air France> (12),Madrid,Milan
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),London,Stockholm
3,Budapest_PaRis,0.0,[13],12. Air France,Budapest,Paris
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",Brussels,London

In [88]:
del df1['FlightNumber_ne']

In [461]:
print(ls2)

None

In [92]:
df1

,From_To,FlightNumber,RecentDelays,Airline,From,To,FlightNumber_new
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),London,Paris,10045
1,MAdrid_miLAN,0.0,[],<Air France> (12),Madrid,Milan,10055
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),London,Stockholm,10065
3,Budapest_PaRis,0.0,[13],12. Air France,Budapest,Paris,10075
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",Brussels,London,10085

In [483]:
type(df1['RecentDelays'])

pandas.core.series.Series

In [94]:
lsredays=df1['RecentDelays'].tolist()

In [96]:
import itertools
l=[[1, 4, 7], [2, 5], [3, 6, 9]]
res=list(map(list, itertools.zip_longest(*lsredays, fillvalue=0)))
res

[[23, 0, 24, 13, 67], [47, 0, 43, 0, 32], [0, 0, 87, 0, 0]]

In [130]:
df1

,From_To,FlightNumber,RecentDelays,Airline,From,To,FlightNumber_new,delay_1,delay_2,delay_3
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),London,Paris,10045,23,47,0
1,MAdrid_miLAN,0.0,[],<Air France> (12),Madrid,Milan,10055,0,0,0
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),London,Stockholm,10065,24,43,87
3,Budapest_PaRis,0.0,[13],12. Air France,Budapest,Paris,10075,13,0,0
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",Brussels,London,10085,67,32,0

In [136]:
an=df1['Airline']
an

0                 KLM(!)
1      <Air France> (12)
2    (British Airways. )
3         12. Air France
4            "Swiss Air"
Name: Airline, dtype: object

In [137]:
alls=[]
for i in df1['Airline']:
    s = re.sub('[\W_]+', '',i) 
    alls.append(s)
alls

['KLM', 'AirFrance12', 'BritishAirways', '12AirFrance', 'SwissAir']

In [138]:
df1['Airline_new']=alls

In [139]:
df1

,From_To,FlightNumber,RecentDelays,Airline,From,To,FlightNumber_new,delay_1,delay_2,delay_3,Airline_new
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),London,Paris,10045,23,47,0,KLM
1,MAdrid_miLAN,0.0,[],<Air France> (12),Madrid,Milan,10055,0,0,0,AirFrance12
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),London,Stockholm,10065,24,43,87,BritishAirways
3,Budapest_PaRis,0.0,[13],12. Air France,Budapest,Paris,10075,13,0,0,12AirFrance
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",Brussels,London,10085,67,32,0,SwissAir

In [140]:
df2=df1

In [141]:
df2

,From_To,FlightNumber,RecentDelays,Airline,From,To,FlightNumber_new,delay_1,delay_2,delay_3,Airline_new
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),London,Paris,10045,23,47,0,KLM
1,MAdrid_miLAN,0.0,[],<Air France> (12),Madrid,Milan,10055,0,0,0,AirFrance12
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),London,Stockholm,10065,24,43,87,BritishAirways
3,Budapest_PaRis,0.0,[13],12. Air France,Budapest,Paris,10075,13,0,0,12AirFrance
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",Brussels,London,10085,67,32,0,SwissAir

In [142]:
del df2['From_To']

In [143]:
del df2['FlightNumber']

In [144]:
del df2['RecentDelays']

In [145]:
del df2['Airline']

In [146]:
df2

,From,To,FlightNumber_new,delay_1,delay_2,delay_3,Airline_new
0,London,Paris,10045,23,47,0,KLM
1,Madrid,Milan,10055,0,0,0,AirFrance12
2,London,Stockholm,10065,24,43,87,BritishAirways
3,Budapest,Paris,10075,13,0,0,12AirFrance
4,Brussels,London,10085,67,32,0,SwissAir